print("toska")  # текущее положение дел
print(type("toska"))  # определили тип введённой информации как строка - текст
print(5 + 5)  # сумма целых чисел
print(type(5 + 5))  # определили тип как int - целые числа
print(5.2)  # ввели целое с десятичной дробью
print(type(5.2))  # определили тип как флоат - с плавающей точкой
# (т.е. дробное число)
print("1" + "1")  # склеили числа - это не суммирование
print(type("1" + "1"))  # распознано как сторка т.е. текст
print("TOS" + "KA")  # склеили строку
print(type("TOS" + "KA"))  # тип остался стринг - сторка
# вводим логику - boolean:  истна (True) или ложь (Falce)
print(0 > 2)  # в коде увидим что это ложь
print(type(0 > 2))  # прописался класс ифнормации как логика
# если запросов по логике будет два и более одновременно то логика укажет все три
print(2 < 0, 3 < 1, 5 > 1)
print(5 != 5)
print(7 == 9)
print(5 != 9 and 7 == 7)  # and условие когда обе величины должны быть true
print(5 != 5 or 7 == 7)  # or условие когда  одна из величин должна быть true
